## Plan Result (staging - TerraformPlanApply)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_linux_function_app.funcapp
* Update
  * azurerm_subnet.function_subnet3
  * module.storage.azurerm_storage_account.storage_account
* Move
  * azurerm_virtual_network_peering.hub-to-juror => azurerm_virtual_network_peering.hub-to-juror[0]
  * azurerm_virtual_network_peering.juror-to-hub => azurerm_virtual_network_peering.juror-to-hub[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_function_app.funcapp will be created
  + resource "azurerm_linux_function_app" "funcapp" {
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "baubais-stg-functionapp"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "baubais-data-factory-rg-stg"
      + service_plan_id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Web/serverFarms/baubais-stg-asp"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "synapsebaubaisstg"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + virtual_network_subnet_id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Network/virtualNetworks/baubais-adf-vnet-stg/subnets/function-privateendpoints"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)
        }
    }

  # azurerm_subnet.function_subnet3 will be updated in-place
  ~ resource "azurerm_subnet" "function_subnet3" {
        id                                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Network/virtualNetworks/baubais-adf-vnet-stg/subnets/function-privateendpoints"
        name                                          = "function-privateendpoints"
        # (8 unchanged attributes hidden)

      + delegation {
          + name = "function-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # azurerm_virtual_network_peering.hub-to-juror has moved to azurerm_virtual_network_peering.hub-to-juror[0]
    resource "azurerm_virtual_network_peering" "hub-to-juror" {
        id                                     = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/virtualNetworks/hmcts-hub-nonprodi/virtualNetworkPeerings/hmcts-hub-nonprodi-to-baubais-adf-vnet-stg"
        name                                   = "hmcts-hub-nonprodi-to-baubais-adf-vnet-stg"
        # (11 unchanged attributes hidden)
    }

  # azurerm_virtual_network_peering.juror-to-hub has moved to azurerm_virtual_network_peering.juror-to-hub[0]
    resource "azurerm_virtual_network_peering" "juror-to-hub" {
        id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Network/virtualNetworks/baubais-adf-vnet-stg/virtualNetworkPeerings/baubais-adf-vnet-stg-to-hmcts-hub-nonprodi"
        name                                   = "baubais-adf-vnet-stg-to-hmcts-hub-nonprodi"
        # (11 unchanged attributes hidden)
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/synapsebaubaisstg"
        name                               = "synapsebaubaisstg"
        tags                               = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Target":"staging - TerraformPlanApply","Vars":{}} -->